Tekla Open API Reference for Tekla Structures 2025
UnitAttributes.Format Property
 Gets or sets the format to use.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FormatTypes Format { get; set; }
Public Property Format As FormatTypes
	Get
	Set
Property Value
Type: FormatTypes
See Also
Reference
UnitAttributes Class
Tekla.Structures.Drawing Namespace